SM_для_EDT/src/InformationRegisters/рарусВерсииКонфигурации/рарусВерсииКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусВерсииКонфигурации</name>
  <resources>
    <name>НомерВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерВерсииПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УзелПрефикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/InformationRegisters/рарусВерсииКонфигурации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	// ++ rarus makole 2021-09-16	
Функция ВерсияКонфигурацииУзла(Узел) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(рарусВерсииКонфигурации.НомерВерсии, """") КАК Версия
		|ИЗ
		|	РегистрСведений.ОбщиеНастройкиУзловИнформационныхБаз КАК ОбщиеНастройкиУзловИнформационныхБаз
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рарусВерсииКонфигурации КАК рарусВерсииКонфигурации
		|		ПО ОбщиеНастройкиУзловИнформационныхБаз.Префикс = рарусВерсииКонфигурации.УзелПрефикс
		|ГДЕ
		|	ОбщиеНастройкиУзловИнформационныхБаз.УзелИнформационнойБазы = &Узел";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаВерсии = РезультатЗапроса.Выбрать();
		ВыборкаВерсии.Следующий();
		Результат = ВыборкаВерсии.Версия;
	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции		
// -- rarus makole 2021-09-16

#КонецЕсли
